/**
 * BolNagri layout table.
 * BolNagri is a phonetic keymap for Devanagari script, but primarily for use with Hindi.
 * http://www.indlinux.org/wiki/index.php/BolNagri
 * @author G Karunakar ([[user:GKarunakar]])
 * @date 2012-03-23
 * License: GPLv3
 */

 // Normal rules
var rules = [
['a', '', 'ा'],
['b', '', 'ब'],
['c', '', 'च'],
['d', '', 'द'],
['e', '', 'े'],
['f', '', 'ट'],
['g', '', 'ग'],
['h', '', 'ह'],
['i', '', 'ि'],
['j', '', 'ज'],
['k', '', 'क'],
['l', '', 'ल'],
['m', '', 'म'],
['n', '', 'न'],
['o', '', 'ो'],
['p', '', 'प'],
['q', '', '‌\u200C'], // ?
['r', '', 'र'],
['s', '', 'स'],
['t', '', 'त'],
['u', '', 'ु'],
['v', '', 'ड'],
['w', '', 'व'],
['x', '', '्'],
['y', '', 'य'],
['z', '', 'श'],
['A', '', 'आ'],
['B', '', 'भ'],
['C', '', 'छ'],
['D', '', 'ध'],
['E', '', 'ै'],
['F', '', 'ठ'],
['G', '', 'घ'],
['H', '', 'ः'], // Visarga
['I', '', 'ी'],
['J', '', 'झ'],
['K', '', 'ख'],
['L', '', 'ॢ'],
['M', '', 'ऽ'],
['N', '', 'ण'],
['O', '', 'ौ'],
['P', '', 'फ'],
['Q', '', '‌\u200C'],
['R', '', 'ृ'],
['S', '', 'ष'],
['T', '', 'थ'],
['U', '', 'ू'],
['V', '', 'ढ'],
['W', '', 'ॐ'],
['X', '', 'ॉ'],
['Y', '', 'ञ'],
['Z', '', 'ॅ'],
['\\`', '', 'ं'],
['\\~', '', 'ँ'],
['\\\\', '', '।'], // Danda
['\\|', '', '॥'],
['\\.', '', '़'],
['\\<', '', '॰']
];

// For full Vowels
var rules_x = [
['a', '', 'अ'],
['A', '', 'आ'],
['i', '', 'इ'],
['I', '', 'ई'],
['u', '', 'उ'],
['U', '', 'ऊ'], // altgr+U triggers file upload!
['e', '', 'ए'],
['E', '', 'ऐ'],
['o', '', 'ओ'],
['O', '', 'औ'],
// Dev digits
['0', '', '०'],
['1', '', '१'],
['2', '', '२'],
['3', '', '३'],
['4', '', '४'],
['5', '', '५'],
['6', '', '६'],
['7', '', '७'],
['8', '', '८'],
['9', '', '९']
];

jQuery.narayam.addScheme( 'hi-bolnagri', {
	'namemsg': 'narayam-hi-bolnagri',
	'extended_keyboard': true,
	'lookbackLength': 0,
	'keyBufferLength': 0,
	'rules': rules,
	'rules_x': rules_x
} );
